Tekla.Structures.Geometry3d.Vector3Comparer
This class provides a means of sorting positions by their location along a specified direction vector.

Tekla.Structures.Geometry3d.Vector3Comparer.direction
The direction.

Tekla.Structures.Geometry3d.Vector3Comparer.#ctor(Tekla.Common.Geometry.UnitVector3)
Initializes a new instance of the Tekla.Structures.Geometry3d.Vector3Comparer class.
direction: The direction.

Tekla.Structures.Geometry3d.Vector3Comparer.Compare(Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Vector3)
Compares the two given positions relative to the .
x: The first position.
y: The second position.
Returns: An integer, 1 if the first position is further, -1 if the second
position is further and 0 if the positions are the same distance along the vector.